# LoadsMayBeNotUpToDate Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..LoadsMayBeNotUpToDate Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Reactions defined as Internal Load (Is Reaction) may no longer be valid since the analytical model has changed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LoadsMayBeNotUpToDate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadsMayBeNotUpToDate As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LoadsMayBeNotUpToDate {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace